import streamlit as st


st.title("ยินดีต้อนรับสู่โปรไฟล์ของฉัน✨")
st.write("นี่คือเว็บแอปพลิเคชันแรกในชีวิตของดิฉัน เชียนด้วยภาษา Python ค่ะ")

st.divider() # เส้นคั่นแบ่งสัดสั่วนให้สวยงาม

# ส่วนข้อมูลส่วนตัว (Profile Info)
st.header("👤ข้อมูลส่วนนตัว")
st.write("ชื่อ-นามสกุล:** นางสาว ธัชกร สุทธฺจำนงค์")
st.write("ชั้น ม.4/11** เลขที่ 42")
st.write("**โรงเรียน:**ยุพราชวิทยาลัย")

# ส่วนปุ่มกดแสดงความรู็สึก
if st.button("คลิกบอกความรู้สึกกับการเขียนเว็บครั้งแรก"):
    st.success(f"ว้าว! สนุกและงายกว่าที่คิดมาก ๆ!🎉")
